## Plan Result (sbox_global - TerraformPlanApply)




<pre><code>Plan: 11 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;labs-gunnertwin-nodejs&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;plumclassic&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;plumclassic&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + expiration_date          = (known after apply)
      + host_name                = "plumclassic.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "plumclassic"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/secrets/plumclassic-managed-secret"
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-gunnertwin-nodejs"
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/plumclassic",
        ]
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-gunnertwin-nodejs"
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/plumclassicHttpsRedirect",
        ]
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["plumclassic"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/plumclassic/origins/plumclassic"
        name                           = "plumclassic"
      ~ origin_host_header             = "sandbox.platform.hmcts.net" -> "plumclassic.sandbox.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-gunnertwin-nodejs",
        ]
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/labs-gunnertwin-nodejs"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/labs-gunnertwin-nodejs/origins/labs-gunnertwin-nodejs",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/labsgunnertwinnodejscaching",
        ]
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "labs-gunnertwin-nodejs"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["plumclassic"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [] -> (known after apply)
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/plumclassic"
      ~ link_to_default_domain          = true -> false
        name                            = "plumclassic"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-gunnertwin-nodejs",
        ]
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/httpsredirect",
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/labsgunnertwinnodejscaching",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "labs-gunnertwin-nodejsHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["plumclassic"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [] -> (known after apply)
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/plumclassicHttpsRedirect"
      ~ link_to_default_domain          = true -> false
        name                            = "plumclassicHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                       = (known after apply)
      + name                     = "labsgunnertwinnodejssboxPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgunnertwinnodejssboxPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/labs-gunnertwin-nodejs"
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                       = (known after apply)
      + name                     = "plumclassicsboxPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumclassicsboxPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["labs-gunnertwin-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-gunnertwin-nodejs"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + value = "_8z9kmrucs2ueak2v3w6tpig9pcnkfbj"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["plumclassic"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.plumclassic"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 11 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2449,"Program":"tfcmt","SHA1":"","Target":"sbox_global - TerraformPlanApply","Vars":{}} -->